1
<?php
	$arr = [
		['a', 'b', 'c'],
		['d', 'e', 'f'],
		['g', 'h', 'i'],
		['j', 'k', 'l'],
	];
	print($arr[3][2]);
	print($arr[1][1]);
	print($arr[2][0]);
	print($arr[0][0]);
?>

2
<?php
	$arr = [
	    [1, 2], 
	    [3, 4], 
	    [5, 6]
	    ];
	print($arr[0][0] + $arr[0][1] + $arr[1][0] + $arr[1][1] + $arr[2][0] + $arr[2][1]);
?>

3
<?php
	$arr = [
		[
			[1, 2],
			[3, 4],
		],
		[
			[5, 6],
			[7, 8],
		],
	];
	print($arr[0][0][0] + $arr[0][0][1] + $arr[0][1][0] + $arr[1][0][0] + $arr[1][0][1] + $arr[1][1][1]);
?>

4
<?php
	$arr = [
		'boys'  => [1 => 'Коля', 2 => 'Вася', 3 => 'Петя'],
		'girls' => [1 => 'Даша', 2 => 'Маша', 3 => 'Лена'],
	];
	print($arr['boys'][1]);
	print($arr['girls'][2]);
?>

5
<?php
	$arr = [
		'ru' => ['пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс'],
		'en' => ['mn', 'ts', 'wd', 'th', 'fr', 'st', 'sn'],
	];
	print($arr['en'][2]);
?>